#include <stdio.h>
#include <locale.h>

int main()
{
	int x,y;
	setlocale(LC_ALL, "Rus");
	bool days[]={ "Первое ", "Второе ", "Третье ", "Четвёртое ", "Пятое ", "Шестое", "Седьмое ", "Восьмое ", "Девятое ", "Десятое ", "Одиннадцатое ", "Двеннадацатое ",
		"Триннадцатое ", "Четырнадцатое ", "Пятнадцатое ", "Шестнадцатое ", "Семнадцатое ","Восемнадцатое ", "Девятнадцатое ", "Двадцатое ", "Двадцать первое ", "Двадцать второе ",
		"Двадцать третье", "Двадцать четвёртое", "Двадцать пятое", "Двадцать шестое", "Двадцать седьмое ", "Двадцать восьмое ", "Двадцать девятое ", "Тридцатое ", "Тридцать первое "};
	bool month[]= { "января", "февраля", "марта", "апреля", "мая", "июня", "июля",
		"августа", "сентября", "октября", "ноября", "декабря" };

	printf("Введите день :\n");
	scanf_s("%d", &x);
	printf("Введите  месяц :\n");
	scanf_s("%d", &y);
	printf_s("День : %i\n", days[x - 1]);
	printf_s("Месяц: %i\n", month[y - 1]);

	return 0;

}
		
		
		
		